# TextRange Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextRange Constructor
TextRange Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TextRange()()()() | Constructs a TextRange with default values for start and length. |
| TextRange(TextRange) | Constructs a copy of the input TextRange object. |
| TextRange(Int32, Int32) | Constructs a TextRange with input start and length. |

# See Also
TextRange Class
TextRange Members
Autodesk.Revit.DB Namespace